Show / Hide Table of Contents
Class ResultOfNLASection
Result of internal forces in the one position
Inheritance
System.Object
ResultOfNLASection
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLASection
Constructors
Improve this Doc   View Source
ResultOfNLASection()
Constructor
Declaration
public ResultOfNLASection()
Properties
Improve this Doc   View Source
Points
Results in points
Declaration
public List<ResultOfNLAPoint> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfNLAPoint>
Improve this Doc   View Source
Position
Position on member
Declaration
public double Position { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source